#+TITLE: Simponic's Settings
#+AUTHOR: Simponic
#+STARTUP: fold

** Format All The Buffers
#+BEGIN_SRC emacs-lisp
  (use-package format-all
    :ensure t)
  (add-hook 'prog-mode-hook 'format-all-mode)
  (add-hook 'format-all-mode-hook 'format-all-ensure-formatter)
#+END_SRC

#+RESULTS:
| format-all-ensure-formatter |

